[["You may be asked to provide personally identifiable information such as your name, address, and/or email address (collectively 'Personally Identifiable Information' or 'PII'),", "Contact_E_Mail_Address_3rdParty"], ["The advertising companies may use information (including or not including PII) about your visits to this and other web sites in order to provide advertisements about goods and services of interest to you.", "Contact_E_Mail_Address_3rdParty"], ["These companies may also employ, among other things, Cookies, Web Beacons, Flash Shared Objects, HTML5 Local Storage and/or HTML5 Mini Databases in furtherance of their services to AccuWeather.", "Contact_E_Mail_Address_3rdParty"], ["Google Analytics.", "Demographic_3rdParty"], ["Some or all of the AccuWeather Sites make use of Google Analytics Demographics and Interest Reporting.", "Demographic_3rdParty"], ["The AccuWeather Sites may also make use of other Google Analytics for Display Advertising features, including Remarketing, Google Display Network Impression Reporting and/or the DoubleClick Campaign Manager integration.", "Demographic_3rdParty"], ["We are required by Google to disclose the following information to you in our Privacy Statement in connection with our use of any Google Analytics for Display Advertising features on the AccuWeather Sites: You may opt out of Google Analytics for Display Advertising or customize Google Display Network ads by using the Google Ads Settings page.", "Demographic_3rdParty"], ["You may also prevent your data from being collected and used by Google Analytics by opting out through the use of the Google Analytics Opt-out Browser Add-on.", "Demographic_3rdParty"], ["Data from Google Analytics Demographics and Interest Reporting may be utilized by AccuWeather to help recognize and understand user preferences, to make improvements to the AccuWeather Sites, to choose content and advertising to display to you, and for other business purposes that will allow AccuWeather to better serve you.", "Demographic_3rdParty"]]