[["Alternatively, you can opt out of third-party vendors' use of cookies by visiting the Network Advertising Initiative opt-out page.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Any information collected is used only for remarketing purposes and will not be used by third-party marketing vendors for any other purpose.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["As a result, third-party vendors, including Google, may show Avast ads on sites on the Internet.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Remarketing is a way for us to reconnect with users, based upon your past interactions with the Avast website.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Remarketing: In addition to foregoing we may employ 3rd party remarketing services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Third-party marketing vendors may be hired by Avast to perform remarketing services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Third-party vendors, including Google, use cookies to serve ads based on a user's prior visits to Avast website.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["To opt out of customized Google Display Network ads visit the Ads Preferences Manager.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Because Google Analytics and Adobe SiteCatalyst require cookies to function, users who wish to avoid tracking by Google Analytics and Adobe SiteCatalyst while on our site can disable cookies on their web browsing software (see above).", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Google Analytics and Adobe SiteCatalyst help us understand the use of our site by our visitors.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The information generated by the cookie about your use of the website (including your IP address) will be transmitted to and stored by Google on servers in the United States.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["(6) Offering of our mobile products: When you download or update our product, we may use information contained in third party cookies on your computer, such as information about the operating system on your mobile devices and related email address.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Then we will maintain this information only for statistical purposes.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We will use this information only for the purpose of offering you our mobile products such as Avast Free Mobile Security and, in case you agree, installing them on your device(s).", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Certain third party's partners/service providers may also use cookies in relation to services they provide on or via SafePrice.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Our third party's partners/service providers do not use cookies.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]