[["In some cases, the site feature you choose may allow a third party to place cookies or local storage devices on your computer.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The third party who places cookies on your device is responsible for how they process their data and Badoo recommends that you read their privacy policies.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Third parties who place cookies on your device when you use Badoo include, and we have included a link to their privacy policies: Twitter, https://twitter.com/privacy Facebook, http://www.facebook.com/about/privacy/your-info-on-other#socialplugin YouTube, http://www.google.co.uk/intl/en/policies/privacy/ AddThis, http://www.addthis.com/privacy Performance We need to use certain cookies and local storage devices to ensure our members have the best possible experience, such assisting with your navigation of our site, ensuring pages load up quickly and respond faster to your requests for Badoo services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may share aggregated information with such parties as Foursquare that includes your personal information (but which doesn't identify you directly), together with other information including log data with third parties for industry analysis and demographic profiling and to deliver targeted advertising about other products and services.", "Demographic_3rdParty"], ["In particular, in relation to targeted advertising, we use third-party advertising companies to serve ads when you visit our Website.", "Demographic_3rdParty"], ["These companies may use information about your visits to this and other websites in order to provide advertisements about goods and services of interest to you.", "Demographic_3rdParty"], ["Third parties do not automatically track certain information such as your IP and email addresses.", "Contact_E_Mail_Address_3rdParty"], ["We do not share aggregated information with such parties as Foursquare that includes your personal information (but which doesn't identify you directly), together with other information including log data with third parties for industry analysis and demographic profiling and to deliver targeted advertising about other products and services.", "Demographic_3rdParty"]]