[["To do this more efficiently, the third party advertiser may use and place on your device certain web technologies, such as web beacons or mobile analytics, to collect from you Non-PII (in most cases, certain Device Information) while you use BANDAI NAMCO's mobile applications or other applications participating in the same third party advertiser's ad network.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Certain third party advertisers listed in Section A9, below, may collect certain Device Information (such as your device's unique device identifier (UDID), Google Advertising ID (GAID), Android ID, ID for Advertisers (IDFA), ID for Vendors (IDFV), MAC address, International Mobile Equipment Identity (IMEI) or your IP address) to analyze your interest in advertisements displayed to you and to serve other advertisements more likely to appeal to your interests.", "Identifier_Ad_ID_3rdParty"], ["/ Flurry: https://dev.flurry.com/secure/optOut.do Fyber: https://www.fyber.com/privacypolicy-en.html HeyZap: http://www.heyzap.com/legal/privacy InMobi: http://www.inmobi.com/page/opt-out/ Millennial Media: http://www.millennialmedia.com/privacy-policy/opt-out Ogury: http://www.ogury.co/privacy.html Tapjoy: https://home.tapjoy.com/info/third-party-opt-out/ Unity: https://unity3d.com/legal/privacy-policy Upsight: http://www.upsight.com/pricing/terms-of-service/ Tune: https://www.optoutmobile.com Resetting your device's mobile advertising ID: Please follow these instructions to opt out of interest-based advertising or to reset the advertising identifier on your mobile device: For iOS devices: To opt-out or change the settings, on your iOS device, open the Settings app, select the \"Privacy\" category, and tap the \"Advertising\" option at the bottom of the screen.", "Identifier_Ad_ID_3rdParty"], ["Activate the \"Limit Ad Tracking\" option to disable interest-based ads or tap \"Reset Advertising Identifier\" if you'd like to continue seeing interest-based ads in the future but wipe your existing profile.", "Identifier_Ad_ID_3rdParty"], ["Opting out from interest-based advertisements served by certain third party advertisers: Please refer to the instructions at the following URLs to opt out of interest-based advertisements that may be served by the following third party advertisers: AdColony: http://www.adcolony.com/privacy-policy/opt-out/ AdMob: https://www.google.com/ads/preferences/html/mobile-about.html Chartboost: https://answers.chartboost.com/hc/en-us/articles/200780269-Privacy-Policy Fiksu: https://www.fiksu.com/end-user-opt-out Yahoo!", "Identifier_Ad_ID_3rdParty"], ["For Android devices: Go to your Google Setting app.", "Identifier_Ad_ID_3rdParty"], ["Tap \"Ads\" under Services and enable the \"Opt out of interest-based ads\" option.", "Identifier_Ad_ID_3rdParty"], ["You can also reset your advertising ID from that menu by tapping \"Reset advertising ID.\"", "Identifier_Ad_ID_3rdParty"]]