[["Disclosure to Trusted Third Parties By Us.", "Contact_E_Mail_Address_3rdParty"], ["For example, outsourced customer care agents or technology assistants may need access to your information to perform services for you.", "Contact_E_Mail_Address_3rdParty"], ["If you do not wish to receive offers from our trusted partners, you can change your e-mail preferences at any time by following the steps outlined in the \"Choice/Opt-Out\" section below.", "Contact_E_Mail_Address_3rdParty"], ["In addition, from time to time, we may share PII (such as e-mail or mailing address) about our user base with carefully selected third parties, so they can offer goods and services that we believe may be of interest to our users.", "Contact_E_Mail_Address_3rdParty"], ["We may share your PII, sometimes in conjunction with your non-PII, with service providers that may be associated with us to perform functions on our behalf.", "Contact_E_Mail_Address_3rdParty"], ["We may share your non-PII with third parties, but not in a manner that would reveal your identity.", "Contact_E_Mail_Address_3rdParty"], ["Your information will be treated as private and confidential by such service providers and not used for any other purpose than we authorize.", "Contact_E_Mail_Address_3rdParty"], ["These companies may employ cookies and web beacons to measure advertising effectiveness.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may use third-party advertising agencies or other service providers to serve ads on our website on behalf of eHarmony or third-party advertisers (e.g., retailers of goods or services).", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Cookie management tools provided by your browser will not remove Flash cookies.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Flash cookies are different from browser cookies because of the amount of, type of, and how data is stored.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Third Parties, with whom we partner to display advertising based upon your web browsing activity, use Flash cookies to collect and store information.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["To learn how to manage privacy and storage settings for Flash cookies click here:", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Links to or Access from Other Sites You may be able to access your account or content of your account from third party sites, such as social networking sites, by way of various applications.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Such sites may also place their own cookies or other files on your computer, collect data or solicit personal information from you.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The privacy policies and practices of such sites in connection with information you disclose on such sites may differ from the practices of eHarmony as set forth in this privacy statement, and you should review their policies and practices to ensure that the privacy of the information you submit on their site does not conflict with and is consistent with how you wish your information to be treated.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We are not responsible for the privacy policies or practices or the content of any other websites that may provide access to, or be linked to or from, this site, including that of any social networking sites and third party advertisers whose offerings require you to navigate away from our site.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]