[["Non-Personal Information may include various technical information, such as information about your device, your browser type, screen resolution, device type, language, version and type of operating system, mobile phone carrier, network provider, network status, SDK version, browser cookies, API key, application version, Android or iOS Vendor, Flash version, geo location (not specific enough to identify a city or town), storage size, screen size, firmware, aggregated data log files from servers, session information, levels achieved, in-app purchases, advertisement response (including clicks on ads, if it originated a follow-up action to a third party e.g, \"conversion\" event), which advertisements are shown, the date and time a particular ad is served, angle view, information about the advertisements reviewed by the user.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We and our Providers collect anonymous information by which users cannot be directly or indirectly identified (''Non-Personal Information'').", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Our Advertising Providers may use cookies and other web-tracking technologies to collect Non-personal Information in case the user clicks on any of their advertisements.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The Apps include third parties' SDK's to collect the Information needed to display advertisements.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The Information is used for ad serving features such as frequency capping (so that you are not displayed with the same ad twice etc.)", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The Information may be stored on the user's device through generally accepted industry technologies used within our apps (such as cookies, local storage).", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["and ad mediation.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Information collected by third parties, which may include such things as location information or contact details, is governed by their privacy practices.", "Contact_3rdParty"], ["These other websites or services may place their own cookies or other files on your computing device, collect information or solicit personal information from you.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]