[["Information that identifies a particular person is \"Personally-Identifiable Information\" or \"PII.\"", "Contact_Postal_Address_3rdParty"], ["It could be a full name, or address.", "Contact_Postal_Address_3rdParty"], ["We will not share this information with an advertiser, and we will not share it with another website or company, unless you tell us to (for example, if you want to post information from your Plaxo page on your Facebook page).", "Contact_Postal_Address_3rdParty"], ["All of these parties may use cookies and other technology to help them understand how you interact with their services so they can deliver you ads that are more useful to you.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["In addition, our content providers may have the right to sell ads in the content they distribute through the Comcast Web Services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We use advertising networks to help us display ads to you.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["As with other websites, you may be able delete any cookies placed on your device by the social network using your browser.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The term \"Non-Personally Identifiable Information\" or \"non-PII\" refers to information that is demographic, aggregated, or does not otherwise identify a specific person, such as a person's gender, ZIP code, or other information when that information is not used with Personally Identifiable Information.", "Contact_ZIP_3rdParty"], ["Your Data does not include information that third parties may independently gather from other websites about you using their own cookies, as further described in this Privacy Policy.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["As with other websites, you may be able delete any cookies placed on your device by the social network using your browser.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Some of the third-party service providers that Comcast uses to deliver services, content, and advertising on the Comcast Web Services may collect information from those services, as disclosed in this Privacy Policy.", "Contact_Postal_Address_3rdParty"], ["This information may include PII or may be used to contact you online.", "Contact_Postal_Address_3rdParty"], ["But the information that these providers independently collect through their pixels, cookies, and other technologies described in Section 8, is subject to their own privacy policies, not Comcast's Web Services Privacy Policy.", "Contact_ZIP_3rdParty"], ["If we share non-PII elements of Your Data with these providers, they will keep this information confidential and only use it for specific purposes determined by Comcast.", "Contact_ZIP_3rdParty"], ["These providers use non-PII elements of Your Data shared with them by Comcast and its affiliates (such as the type of Comcast products and services that you purchase), and other information that they independently collect from your interaction with the Comcast Web Services and other digital properties that contain their technology.", "Contact_ZIP_3rdParty"], ["We may also use one or more advertising networks and/or other audience segmenting technology providers to help select and deliver content on the Comcast Web Services, and advertisements sold by and promotional offers from Comcast on the Comcast Web Services and other digital properties.", "Contact_ZIP_3rdParty"], ["In addition, the third parties that provide Web Log services for Comcast may use cookies to uniquely distinguish your web browser and to keep track of the websites that your web browser visits across the service provider's network of websites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The advertising networks and/or content providers that deliver ads on the Comcast Web Services may use technologies such as HTTP cookies, Flash cookies, and HTML5 local storage to uniquely distinguish your web browser and keep track of information relating to serving ads on your web browser, such as the type of ads shown and the web pages on which the ads appeared.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]