[["Privacy Policy - Effective May 3, 2016 Quick Links To read our detailed privacy policy click here To opt-out of many third-party tracking technologies for interest-based advertising, follow the instructions here To opt-out of precise location tracking of your mobile device, follow the instructions here To opt-out of promotions sent by mail from third parties, click here.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["To opt-out of promotions sent by mail from Meredith Corporation, click here.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["To update or correct your information with Meredith, click here", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["If you are a mobile app user, you may be able to reset the advertising identifier used to deliver interest-based ads to your device or prevent the related collection of user data across unaffiliated applications for interest-based advertising by accessing the privacy settings in your device.", "Identifier_Ad_ID_3rdParty"], ["When you visit a page that includes one of these sharing tools, the third-party company that operates the tool may be collecting information about your browser, device and online activity through its own tracking technologies and subject to its own separate privacy policy, which may differ from ours.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["If the third-party operator recognizes a cookie that identifies you as one of its registered users, it will append the impression data it receives, which may identify you as a user our Services, with age and gender information before returning the data to Nielsen.", "Demographic_Age_3rdParty"], ["Some of our advertisers may participate in a program operated by the Nielsen Company to develop an Online Campaign Ratings service that is comparable to Nielsen's television ratings.", "Demographic_Age_3rdParty"], ["When one of their ads appears on our Services, it may contain a web beacon that will record your exposure to the ad, read certain cookies on your browser, and forward this information to one or more operators of third-party websites or other online service on which you may have registered.", "Demographic_Age_3rdParty"], ["The following describes some of the circumstances in which we may share information about our users: Email.", "Contact_E_Mail_Address_3rdParty"], ["We Disclose Information and Your Related Opt-out Choices: Except as otherwise expressly noted herein or within the Services, we may share any information collected through our Services, including without limitation, your name, postal address (and any other information we combine with that information) with our Meredith-affiliated companies, our provider partners and service providers, and with carefully selected third-party organizations and marketers of products and services potentially of interest to you.", "Contact_E_Mail_Address_3rdParty"], ["They use this email response information in combination with your email address to target and optimize the delivery of emails and email advertising they send on our behalf and for their other clients.", "Contact_E_Mail_Address_3rdParty"], ["We may also provide our service providers with lists of our user email addresses in a hashed, encrypted or anonymized form that they use to recognize our users as they navigate online or use third-party email services and enable the delivery of interest-based advertising to those users.", "Contact_E_Mail_Address_3rdParty"], ["We share our users' email addresses with service providers that send email messages and deliver targeted advertising on our behalf.", "Contact_E_Mail_Address_3rdParty"], ["If you use our Services to sign up for special email offers from third-party advertisers, we will also share your email address and any other information you provided with your request with the advertisers you selected.", "Contact_E_Mail_Address_3rdParty"], ["Please note that if you choose to opt-out of Meredith's promotional mailings, you may still receive renewal notices and related offers for any magazines to which you subscribe.", "Contact_Postal_Address_3rdParty"], ["To remove your name and postal address from lists that we sell or rent to third parties for their direct marketing purposes, or to opt-out of receiving marketing offers for other Meredith magazines and products by mail, please use the opt-out form available here or send your request to us in a letter addressed to Meredith Corporation, Opt-Out Postal, Attn: Circulation, 1716 Locust Street, Des Moines, Iowa 50309.", "Contact_Postal_Address_3rdParty"]]