[["As described in Sections 3 and 5 of this Privacy Policy, we sometimes work with third parties to deliver ads, content or offers.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Sometimes we or these third parties do so through a mobile \"SDK.\"", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The SDK is a bit of computer code that app developers can include in their apps to enable ads to be shown, data to be collected, and related services to be implemented.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may use this and similar technology to deliver certain advertising through mobile applications and browsers based on data associated with your mobile device, and we may work with third parties who likewise embed their SDKs into Apalon Apps, for third party advertising.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["For instance, that advertising may be based on your real-time or \"contextual\" application usage or general location inferred from IP address.", "Identifier_IP_Address_3rdParty"], ["We may share your Information as follows:", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["When you elect to engage in a particular merchant's offer or program, you authorize us to provide your email address and other Information to that merchant.", "Contact_E_Mail_Address_3rdParty"], ["When you engage in promotions offered through the Apalon Apps, we may share your Information with the businesses with which we partner to offer you those products, services, promotions, contests and/or sweepstakes; unless, we have otherwise committed to you that we will not share specific Information you provided.", "Contact_E_Mail_Address_3rdParty"], ["These companies may use technologies to collect data about users, including non-precise and/or precise location data, to help them tailor relevant ads and content and analyze and measure ads' effectiveness or, more generally, brand and mobile audiences.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may also allow third-parties, including our authorized service providers, parent and subsidiary companies, affiliates, advertising companies and ad networks, to display advertisements in the Apalon Apps or other apps or use App Identifiers for the purpose of advertising and direct marketing.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["For example, if you use the iOS platform then Advertiser IDs (also known as \"IDFAs\" if you have an Apple device or \"Android Ad IDs\" if you have an Android device) may be collected.", "Identifier_3rdParty"], ["Other identifiers collected may include IP addresses, OpenUDID, Session ID, ODIn1, iOS Vendor IDs, MAC addresses, IMEI, Android ID for Android platform, and ODIN1 for OS X (together with the IDFAs, the \"App Identifiers\").", "Identifier_3rdParty"], ["Apalon uses the Google Analytics tool Firebase in order to carry out analysis on Information which is gathered by Apalon Apps.", "Identifier_3rdParty"], ["App Identifiers and other Information which Apalon gather are provided to Google in order to enable them to carry out data analysis.", "Identifier_3rdParty"], ["We do not allow third-parties, including our authorized service providers, parent and subsidiary companies, affiliates, advertising companies and ad networks, to display advertisements in the Apalon Apps or other apps or use App Identifiers for the purpose of advertising and direct marketing. These companies may not use technologies to collect data about users, such as non-precise and/or precise location data.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["For instance, that advertising may not be based on your real-time or \"contextual\" application usage nor the general location inferred from IP address.", "Identifier_IP_Address_3rdParty"], ["For example, if you use the iOS platform then Advertiser IDs (also known as \"IDFAs\" if you have an Apple device or \"Android Ad IDs\" if you have an Android device) may are not collected. Other identifiers not collected include IP addresses, OpenUDID, Session ID, ODIn1, iOS Vendor IDs, MAC addresses, IMEI, Android ID for Android platform, and ODIN1 for OS X (together with the IDFAs, the \"App Identifiers\"). ... Apalon doesn't use the Google Analytics tool Firebase. App Identifiers and other Information which Apalon does not gather are neither provided to Google.", "Identifier_3rdParty"], ["We don't work with third parties to deliver ads, content or offers. We are not using any mobile \"SDK.\" The SDK is a bit of computer code that app developers can include in their apps to enable ads to be shown, data to be collected, and related services to be implemented. We don't use these or similar technology.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["When you engage in promotions offered through the Apalon Apps, we may not share your Information with the businesses with which we partner. When you elect to engage in a particular merchant's offer or program we won't provide your email address and other Information to that merchant.", "Contact_E_Mail_Address_3rdParty"]]