[["Our cross-device matching service providers Crosswise and Tapad collect device activity logs which may include IP address, WiFi networks used, geolocation, email address, websites browsed, ads displayed, device type, operating system, browser cookies, mobile device IDs, gender, age, information stored in cookies, time of day website accessed or mobile app used, and other information in connection with providing advertising services to us.", "Contact_E_Mail_Address_3rdParty"], ["Flipp may provide an encrypted version of Your information to its advertising partner LiveRamp, to enable better targeted advertising where LiveRamp already possesses Your email address, device ID, or other advertising ID.", "Contact_E_Mail_Address_3rdParty"], ["LiveRamp's privacy policy describes its services and may be accessed here http://liveramp.com/privacy/.", "Contact_E_Mail_Address_3rdParty"], ["To opt out of LiveRamp's advertising services for website browsers, click http://liveramp.com/opt_out/ To opt out of LiveRamp's advertising services for mobile devices, click http://liveramp.com/mobile-opt-out/.", "Contact_E_Mail_Address_3rdParty"], ["Our cross-device matching service providers Crosswise and Tapad collect device activity logs when You use the Service which may include IP address, WiFi networks used, geolocation, email address, websites browsed, ads displayed, device type, operating system, browser cookies, mobile device IDs, gender, age, information stored in cookies, time of day website accessed or mobile app used, and other information in connection with providing advertising services to us.", "Contact_E_Mail_Address_3rdParty"], ["Our remarketing providers, Google and Facebook, use cookies and other tracking mechanisms on the Service and allow Us to market our products to You through advertisements on other websites based on Your past interactions with the Service.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may use remarketing cookies and pixels from Facebook and share some of Your personal information with it for use in advertising.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["You can opt out of Google remarketing by downloading and installing Google's opt-out browser add-on (see below).", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Analytics providers, which help Us measure traffic and usage trends for the Service.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These tools may use cookies and other technologies to collect information about Your use of the Service.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These analytics providers use cookies, pixel tags and other technologies to collect and store information such as Website pages visited, places where users click, time spent on each Website page, IP address, type of operating system used, location-based data, device ID, search history, and phone number.", "Contact_Phone_Number_3rdParty"], ["We use Google Analytics and other third-party analytics providers to better understand who is using the Service and how people are using it.", "Contact_Phone_Number_3rdParty"], ["Google Analytics collects and stores information from users of the Apps, such as an identifier that helps Google determine which ads it has served to other mobile applications on Your device, location-based data, IP address, type of operating system used, device ID, application pages visited, and time spent on each application page and in total.", "Demographic_3rdParty"], ["We also use Google Analytics and other third-party analytics providers in connection with our Apps.", "Demographic_3rdParty"], ["These features use third-party cookies and other tracking mechanisms and allow Us to market our products to You through advertisements on other websites.", "Demographic_3rdParty"], ["We may also participate in certain Google Advertiser features including Demographics and Interest Reporting, Remarketing, and Google Display Network Impression Reporting.", "Demographic_3rdParty"], ["These and other third parties may collect or receive information about Your use of the Service, including through the use of cookies, web beacons and other technologies, and this information may be collected over time and combined with information collected on different websites and online services, which may be used for remarketing and may track users across websites and apps and over time.", "Demographic_3rdParty"], ["We use cookies, which are small data files that are saved to Your device when You visit our website and use the Service.", "Demographic_3rdParty"], ["We may use both session cookies and persistent cookies.", "Demographic_3rdParty"], ["We may include web beacons in our web pages and email messages", "Demographic_3rdParty"], ["We currently use location information in connection with our Apps.", "Demographic_3rdParty"], ["Through cookies We place on Your browser or device, We and our partners may collect information about Your online activity after You leave the Service.", "Demographic_3rdParty"]]