[["), geo-location – only general location may be collected.", "Contact_City_3rdParty"], ["), language (e.g.", "Contact_City_3rdParty"], ["), screen resolution (e.g.", "Contact_City_3rdParty"], ["), type of browser (e.g.", "Contact_City_3rdParty"], ["800×600, 1024×768, etc.", "Contact_City_3rdParty"], ["Android, iOS, etc.", "Contact_City_3rdParty"], ["English), device type (e.g.", "Contact_City_3rdParty"], ["Explorer, Firefox, Chrome, Safari, etc.", "Contact_City_3rdParty"], ["Galaxy, HTC, iPhone, etc.", "Contact_City_3rdParty"], ["Kids Non-personal Information collected by Third Parties may include the following technical information: type of operation system (e.g.", "Contact_City_3rdParty"], ["No street name or city/town name is collected.", "Contact_City_3rdParty"], ["(\"Kids' Persistent Device Identifier\").", "Identifier_Ad_ID_3rdParty"], ["a persistent device identifier from Kids, such as IP address unique device identifier, advertising identifier (when available on a device) etc.", "Identifier_Ad_ID_3rdParty"], ["In addition, Kids Non-personal Information and the Kids' Persistent Device Identifier may also be stored locally on the Users' device via generally accepted industry technologies used within the Kids Apps, such as \"cookies\" and local storage (see Section 19 below for further details with respect to Cookies and Local Storage).", "Identifier_Ad_ID_3rdParty"], ["The abovementioned Kids Non-personal Information and Kids' Persistent Device Identifier are collected by Third Parties through the Users' use of the Kids Apps, including, without limitation, through Third Parties' SDK embedded in our Kids Apps.", "Identifier_Ad_ID_3rdParty"], ["Note that if the User of the Kids Apps clicks on any of these advertisements, the User will leave our Kids Apps and go to the advertisers' site the User selected, and the advertisers may use cookies and other web-tracking technologies to collect Kids Non-personal Information and/or Kids personally identifiable information.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["(iii) information, such as age, gender and logged from device to ensure that appropriate advertising is presented within the App and calculate or control the number of views of an ad, and/or deliver advertisements relating to User's interests, and measure the effectiveness of advertisements campaigns.", "Demographic_Age_3rdParty"], ["Note that if you click on any of these advertisements, the advertisers may use cookies and other web-tracking technologies (such as tracking pixel agent or visitor identification technology, etc.)", "Demographic_Age_3rdParty"], ["The delivery of advertisements to you may be based on IP address, device identifiers and other Personal Information gathered during your use of the Crazy Labs Apps.", "Identifier_Device_ID_3rdParty"], ["These third parties ad networks may collect and use, inter alia", "Demographic_Age_3rdParty"], ["geographic tracking and carrier network preferences.", "Demographic_Age_3rdParty"], ["on your device to collect data regarding advertisement performance, your interaction with such advertisements and our Crazy Labs Apps and your interests (which may include, non-personal and/or personal information (such as, device and network information, unique identifiers, gender, age and geo-location) about you) in order to serve you advertisements, including targeted advertisements, and for the legitimate business interests of such Third Parties ad networks.", "Demographic_Age_3rdParty"], ["This data may include, without limitation, your scores and/or progress in our Crazy Labs Apps, your name, your social media profile picture and any test that you may upload.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["You understand that where you allow interaction with any third party Social Network or Platform, we may share data about you with your contacts (and vice versa) in order that you may enjoy social elements.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["By using the Social Features and/or the Game Center Features you hereby agree and understand that the applicable Social Networks or Platforms may collect certain Personal Information, such as your IP address, Non-personal Information and may set cookies and/or other web tracking technologies to enable the functionality of the Social Features and/or the Game Center Features.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["TabTale may use the following Google Analytics Advertising Features: Google Display Network Impression Reporting, DoubleClick Platform integrations and/or Google Analytics Demographics and Interest Reporting;", "Demographic_3rdParty"], ["A User may prevent or limit targeted advertising from device settings which may vary from device to device.", "Identifier_Ad_ID_3rdParty"], ["For example, if you are using an iOS device with iOS 7 or a newer version, this can be done from settings/privacy/advertising by resetting advertising identifier or limiting ad tracking setting.", "Identifier_Ad_ID_3rdParty"], ["If you are using Google Android device with Android 2.3 or a later version, you can find the ad identifier settings in the app drawer under Google Settings> Ads.", "Identifier_Ad_ID_3rdParty"], ["Please note that activation of any applicable \"Do-not-track\" settings on the User's mobile device or any other device-level setting opt outs for targeted advertising, (to the extent that such options exist) may not cease all tracking activities by TabTale's third parties' service providers.", "Identifier_Ad_ID_3rdParty"], ["that we request Third Parties who collected through the Apps the User's Personal Information and/or, as applicable, the Kids' Persistent Device Identifier, to do the same.", "Identifier_Device_ID_3rdParty"]]