[["Since the third party advertising companies associate your computer/device with a number, they will be able to recognize your device each time they send you an advertisement.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may feature advertisements served by third parties that deliver cookies to your device so the content you access and advertisements you see can be tracked.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Our Services may contain third party analytic and tracking tools from our service providers, including Flurry (flurry.com) and Hockey App (hockeyapp.net).", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Such third parties may use cookies, APIs, and SDKs in our Services to enable them to collect and analyze user information on our behalf.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The third parties may have access to information such as your device identifier, MAC address, IMEI, locale (specific location where a given language is spoken), geo-location information, and IP address for the purpose of providing their services under their respective privacy policies.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The advertisers may collect and use information about you, such as your Service session activity, device identifier, MAC address, IMEI, geo-location information and IP address.", "Identifier_Device_ID_3rdParty"], ["We may feature advertising within our Service.", "Identifier_Device_ID_3rdParty"], ["We do not feature advertising within our Service. There are no advertisers collecting or using information about you, such as your Service session activity, device identifier, MAC address, IMEI, geo-location information and IP address.", "Identifier_Device_ID_3rdParty"], ["The third parties do not have access to information such as your device identifier, MAC address, IMEI, locale (specific location where a given language is spoken), geo-location information, or IP address.", "Identifier_Device_ID_3rdParty"], ["Our Services contain third party analytic and tracking tools from our service providers. However, such third parties are not using cookies, APIs, and SDKs in our Services.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]