[["Alternatively, you can opt out by discontinuing your use of Flipboard.", "Demographic_3rdParty"], ["Aside from that, we use your information to keep Flipboard running, better understand how you use our service, customize your experience (including the content, marketing materials, and advertisements you see), prevent abuse and improve Flipboard.", "Demographic_3rdParty"], ["Flipboard may also work with advertising partners to serve you third-party advertisements, including interest-based advertisements.", "Demographic_3rdParty"], ["For more information about our advertising partners' practices, please visit Datalogix and Oracle.", "Demographic_3rdParty"], ["If you opt out, you'll still see ads, but they won't be tailored using information like your interests, visits to other services, or demographics.", "Demographic_3rdParty"], ["You can learn more about interested-based advertising, including how to opt out of third-party partners' advertising you see on Flipboard and on other services, by visiting http://www.aboutads.info/choices/.", "Demographic_3rdParty"], ["We share your personally identifiable information only under these circumstances:", "Identifier_Ad_ID_3rdParty"], ["To third parties helping us offer and improve our service, such as those providing Flipboard certain technical tools and analytics services (including marketing partners) that help us understand how people use Flipboard so we can make it better.", "Identifier_Ad_ID_3rdParty"], ["We may also share non-personally identifiable, non-aggregate information (for example, anonymized Advertising IDs) with companies that help us improve our products and services, including advertising (such as research companies and analytics providers).", "Identifier_Ad_ID_3rdParty"], ["Depending on your advertising preferences set in your operating system, Flipboard may share your Advertising ID with advertising partners in an anonymous fashion that is not tied to your name or email address.", "Contact_E_Mail_Address_3rdParty"], ["Please note that this privacy policy explains Flipboard's policies only, and doesn't cover the practices of other services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Some publishers or other third-party services that we partner with may use cookies, web beacons or other technologies to keep track of your Internet activity.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]