[["Please note that companies delivering advertisements on our Services may also use cookies or other technologies as described below in Third Party Advertising and Analytics those practices are subject to those companies' own policies.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may disclose or publish aggregated information, which is information about you and other players collectively that is not intended to specifically identify you, (for example, players between the ages of 29 and 34 who live in Berlin) and other non-personal information about our players for industry analysis, demographic profiling, marketing, analytics, and advertising, and other business purposes.", "Demographic_3rdParty"], ["When advertisers or ad networks place ads in our Services, they may collect or we may share with them and with analytics providers the following types of information from our Services: performance data (like the number of clicks on an advertisement); aggregated and/or de-identified information about you and other players collectively that is not intended to specifically identify you (for example, players between the ages of 29 and 34 who live in Berlin); certain technical information (such as, IP addresses, non-persistent device identifiers such as IDFAs, and de-identified persistent device identifiers such as a hashed Android ID); your social network ID", "Identifier_Ad_ID_3rdParty"], ["Advertisers or advertising networks may collect this information by using one of more tracking technologies like browser cookies and web beacons.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["In addition, if you do not want to receive tailored in-application advertisements from third parties that relate to your interests in apps on your mobile device, you may opt-out by adjusting the ad tracking settings on your device.", "Identifier_Ad_ID_3rdParty"], ["You can also reset the \"Advertising Identifier\" (like an IDFA) from your mobile device's settings page, which will prevent continued use of existing behavioral data tied to the previous \"Advertising Identifier.\"", "Identifier_Ad_ID_3rdParty"], ["When advertisers or ad networks place ads in our Services, they do not collect and we do not share with them and with analytics providers the following types of information from our Services: performance data (like the number of clicks on an advertisement); certain technical information (such as, IP addresses, non-persistent device identifiers such as IDFAs, and de-identified persistent device identifiers such as a hashed Android ID); your social network ID ...", "Identifier_Ad_ID_3rdParty"]]