[["Personal Information,\" which is the type of information that specifically identifies you personally and/or can be used alone to contact you online or offline, such as your full name, physical address, email address, telephone number, photograph, precise geolocation information (i.e., your specific location), Gameloft player ID, credit card information and, in some cases, usernames;", "Contact_City_3rdParty"], ["In addition, certain third-party advertisers may also make use of cookies in their ads served within our Websites/Apps.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Such cookies will collect anonymous behavioral data which those advertisers may use to serve you targeted ads both within and outside of our Websites/Apps.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["You can opt out of that practice by certain participating companies by visiting www.aboutads.info/choices and following the steps described therein.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may share non-precise geolocation information or precise geolocation information (if you choose to allow us to collect it) with advertisers to allow them to display more relevant and geographically appropriate advertisements to you.", "Location_3rdParty"], ["We may share your Usage Data and Non-Personal Information, such as device IDs, advertising IDs or other persistent identifiers and non-precise geolocation information with our advertising partners.", "Contact_ZIP_3rdParty"], ["If you decide to use such features, it may allow the sharing and collection of Personal Information and Non-Personal Information both to and from such third-party social networks.", "Contact_City_3rdParty"], ["Our Websites/Apps offer social sharing features such as \"Share\" or \"Like\" on Facebook or other third-party social networking sites.", "Contact_City_3rdParty"], ["We will not share non-precise geolocation information or precise geolocation information with advertisers.", "Location_3rdParty"], ["We do not share your Usage Data and Non-Personal Information, such as device IDs, advertising IDs or other persistent identifiers and non-precise geolocation information with our advertising partners.", "Identifier_3rdParty"]]