[["Groupon, Inc. is a member of the Digital Advertising Alliance, which is a media marketing and trade association that has issued self-regulatory guidelines for online advertising.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Visit the DAA's AdChoices page to learn more about interest-based advertising and to opt-out of having cookies placed by ad-serving companies.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We (or our Vendors on our behalf) may share your Personal Information as required or permitted by law:", "Contact_3rdParty"], ["with our Vendors to provide services for us and who are required to protect the Personal Information", "Contact_3rdParty"], ["We may also disclose Non-Identifiable Information:", "Identifier_3rdParty"], ["with Third-Party Ad-Servers to place our ads and/or ads of our merchants or Business Partners on the Site and on third-party sites, and to analyze the effectiveness of those ads.", "Identifier_3rdParty"], ["They do this by using Cookies, clear gifs and other technologies.", "Contact_3rdParty"], ["We do not share Personal Information with Third-Party Ad-Servers; however, Third-Party Ad-Servers may automatically collect Non-Identifying Information about your visit to the Site and other websites, your device address, your Internet Service Provider and the browser you use to visit the Site.", "Contact_3rdParty"], ["Non-Identifiable Information means information that alone cannot identify you, including data from Cookies, Pixel Tags and Web Beacons, and Device Data.", "Contact_3rdParty"], ["Personal Information means information about you that specifically identifies you or, when combined with other information we have, can be used to identify you.", "Contact_3rdParty"], ["This includes the following types of information: Contact Information: your name, postal addresses, email addresses, social networking website user account names, telephone numbers, or other addresses at which you are able to receive communications.", "Contact_3rdParty"], ["), marketing, data processing and analytics, servicing, collections, ad management, or information technology services.", "Contact_3rdParty"], ["Vendors means, collectively, third parties that perform business operations on behalf of Groupon, such as transaction processing, billing, mailing, communications services (e-mail, direct mail, etc.", "Contact_3rdParty"], ["We also do not disclose Non-Identifiable Information with Third-Party Ad-Servers. Non-Identifiable Information means information that alone cannot identify you, including data from Cookies, Pixel Tags and Web Beacons, and Device Data. Device Data means information concerning a device you use to access, use, or interact with the Site, such as operating system type or mobile device model, browser type, domain, and other system settings, the language your system uses and the country and time zone of your device, geolocation, including precise geolocation, unique device identifier or other device identifier, advertising identifier, mobile phone carrier identification, and device software platform and firmware information.", "Identifier_Ad_ID_3rdParty"]]