[["Indeed may also share information about your behavior on the Site with third parties (including operators of third-party websites and/or social networking sites) in order to show you targeted advertisements and other content that has been customized for you.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Marketing: We use Cookies from third-party partners such as Google and Facebook for marketing purposes.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These Cookies allow us to display Indeed promotional material to you on other sites you visit across the Internet.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Referral Tracking: We use Cookies to associate user activity with the third party website that referred the user to our Website, or to associate user activity that Indeed referred to a third party website.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These third party partner websites receive credit for the activity of users they refer to our Website, or give Indeed credit for the activity of users referred to such third party websites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We do not share any personal information or information about individual user activities with these partner entities.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["In all cases where third party cookies are used to track your behavior on Indeed, you must refer to such third party's site to learn how to remove cookies for that third party specifically.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Removing Indeed cookies from your browser will not affect cookies placed by third parties.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We are not using or disclosing to advertisers information that does not identify you as a specific individual (\"Non-Personal Information\"). Such Non-Personal Information may include, for example and without limitation: MAC addresses and other device identifiers; IP addresses; pixel tags and similar technologies; physical location information; and demographic information, including gender, dates of birth, ZIP codes, etc.", "Contact_ZIP_3rdParty"]]