[["If you use these Features, they will collect your IP address, which page you are visiting on our site, and set a cookie to enable the Feature to function properly.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Our website includes social media Features (\"Features\"), like the Facebook recommend button or interactive mini-programs that run on our site.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Analytics services may work by embedding invisible images that are associated with unique identifiers on our site,", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We use analytics services to measure how people use our website and emails so that we can improve our products and services and provide more relevant content to you.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["As we develop and improve our services, we may use other third parties that are not listed below.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Cookies From Third-Parties We believe it is important for you to know exactly what third-party cookies we use on our website and services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Here is a list of the third-party cookies that we currently use.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Google Analytics - These cookies allow us to see how you use our website and mobile application so that we can improve your experience.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["If you don't want data reported by Google Analytics, Google permits you to opt out by installing the Google Analytics Opt-out Browser Add-on.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We encourage you to read the Google Privacy Policy.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Google AdWords - These cookies allow our vendors to serve ads based on your past visits to our sites and for remarketing purposes.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Google may use this cookie and other tracking technology to show you our ads across the internet.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Google permits you to opt out of Google's use of these cookies by visiting Google's Ads Settings.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Optimizely - These cookies allow us to optimize the look, feel and messaging of our website based upon how you use it.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["You can read the Optimizely Privacy Policy here.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Greenhouse - These cookies are used to provide you with a personalized user experience when you apply for a job with us.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["You can read the Greenhouse Privacy Policy here.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["For example, Marketo cookies let us know whether our emails have been opened, and which links are clicked.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Marketo - These cookies help us track your visits to our website and enable us to create an engaging marketing experience for you.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We also use Marketo cookies to understand your interaction with the emails we send you, and to ensure we're sending you relevant information.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["You can read the Marketo Privacy Policy here.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["LinkedIn Insights - These cookies help us track your visits and your interactions on our website so that we can provide with you an engaging marketing experience.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["They also enable us to deliver more relevant services and content on lookout.com and on LinkedIn's partner sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["You can read the LinkedIn Privacy Policy here.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["If you use these Features, they will collect your IP address, which page you are visiting on our site, and set a cookie to enable the feature to function properly.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Social Media Features - Our website includes social media features, like the Facebook recommend button or interactive mini-programs that run on our site.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Mixpanel, Appboy and mParticle - These cookies allow us analyze and aggregate data regarding your use our mobile application.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We encourage you to read the MixPanel Privacy Policy, Appboy Privacy Policy and mParticle Privacy Policy.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["At this time, we do not respond to Do Not Track browser settings or signals.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["For information about Do Not Track, visit www.allaboutdnt.org.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["In addition, some of our third-party services providers may use standard technology, such as cookies, pixel tags and web beacons, to collect information about your internet activities.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Notice to California Users Do Not Track Do Not Track is a privacy preference that users can set in their web browsers.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["When a user turns on the Do Not Track signal, the browser sends a message to websites requesting them not to track the user.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["You may be able to disable certain third-party cross-site tracking as described in the \"Your Choices\" section above.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Our website does not include social media Features (\"Features\"), like the Facebook recommend button or interactive mini-programs. Third parties will not collect your IP address and do not set cookies.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]