[["Other ads are targeted based on your likely interests or other information learned about you over time using demographic data, search queries, interests and favorites, usage data from our own sites and apps and the sites and apps of our advertisers and partners, and location data - which we refer to as \"interest-based advertising\" in this statement.", "Demographic_3rdParty"], ["The ads that you see may be selected based on your current location, search query, or the content you are viewing.", "Demographic_3rdParty"], ["To provide interest-based advertising, we combine cookies placed on your device using information that we collect (such as IP address) when your browser interacts with our websites.", "Demographic_3rdParty"], ["We share data we collect with third parties such as AOL and AppNexus so that they can select and deliver some of the ads you see on our sites and apps, as well as other sites and apps serviced by these partners.", "Demographic_3rdParty"], ["Advertisers may choose to place our web beacons on their sites in order to allow Microsoft to collect information on their sites such as activities, purchases and visits; we use this data on behalf of our advertising customers to help target their ads.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["In some cases, we share with advertisers reports about the data we have collected on their sites or ads.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We also share data directly with service providers (such as AOL and AppNexus) to permit them to provide services on our behalf or to partner with us in selecting and serving ads for our advertising partners.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Additionally, Microsoft partners with third-party ad companies to help provide some of our advertising services, and we also allow other third-party ad companies to display advertisements on our sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These third parties may place cookies on your computer and collect data about your online activities across websites or online services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Appears on co-branded sites where Microsoft is partnering with an advertiser.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["This cookie identifies the advertiser so the right ad is selected.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Finally, Microsoft products often contain web beacons or similar technologies from third-party analytics providers, which help us compile aggregated statistics about the effectiveness of our promotional campaigns or other operations.", "Contact_E_Mail_Address_3rdParty"], ["However, we prohibit these analytics providers from using web beacons on our sites to collect or access information that directly identifies you (such as your name or email address)", "Contact_E_Mail_Address_3rdParty"], ["These technologies enable the analytics providers to set or read their own cookies or other identifiers on your device, through which they can collect information about your online activities across applications, websites or other products.", "Contact_E_Mail_Address_3rdParty"], ["If you click the link, the content provider may place a cookie on your device to identify you for future transactions.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]