[["Personal Information may include the following: information you make available to us when you open an account or use our services, such as your name, telephone number and email address;", "Contact_E_Mail_Address_3rdParty"], ["information we collect as you use our services, such as certain Location Data and Log Data.", "Contact_E_Mail_Address_3rdParty"], ["\"Location Data\" is information that we collect regarding your location (when you use a location-enabled service), including: the location of your device when you use our services, such as from the GPS, WiFi, compass, accelerometer or other sensors in your mobile device; the IP address of the device or internet service you use to access our services, other information made available by you or others that gives an indication as to where you are or have been located, such as account information that indicates where you are located and Shared Information you or others post indicating your location, such as any geotag information that is embedded in any photos you make available to us", "Contact_E_Mail_Address_3rdParty"], ["\"Log Data\" is technical information that is automatically collected by us when you use our services, whether through the use of cookies, web beacons and log files (as explained in more detail in the \"Cookies, Web Beacons and Log Files\" section below) or otherwise, including: technical information such as your mobile carrier, configuration information made available by your web browser or other programs you use to access our services, your IP address and your device's version and identification number, information about communications you have made using our services, such as the people you've communicated with and the time, data and duration of your communications; and metadata, which means information related to items you have made available through our services, such as the date, time or location that a shared photograph or video was taken or posted.", "Contact_E_Mail_Address_3rdParty"], ["These third parties may be located, and use and store your Personal Information, outside of your jurisdiction for these purposes.", "Contact_E_Mail_Address_3rdParty"], ["We and our affiliate companies may share your Personal Information within our group of companies and with joint venture partners and third party service providers, contractors and agents (such as communication service providers who send emails or push notifications on our behalf, and mapping services providers who assists us and you with location data), in each case, for the purposes of: (i) providing our services to you; (ii) assisting us in carrying out the purposes set out under the \"How We Use Your Information\" section above; (iii) carrying out our obligations and enforcing our rights under this Privacy Policy; and/or (iv) help understand and improve our services.", "Contact_E_Mail_Address_3rdParty"], ["We allow third parties such as analytics providers and advertising partners to collect your Personal Information over time and across different websites or online services when you use our services.", "Contact_E_Mail_Address_3rdParty"], ["For example: you may be able to share content on, or login to, our services using services provided by third parties.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The third parties who provide such services may be able to collect your Information and Personal Information (including your Log Data), and may set cookies on your computer to enable such feature to function properly; and we may (whether in advertisements or otherwise within our services) provide you with links that allow you to access third party services or websites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Third-Party Services on Our Services Our service may link you to, social media or other services (including websites) provided by a third party.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]