[["The option for our partners to display interest-based, or retargeted, ads (''IBA'') is enabled solely for the device IDs that have passed the age gate and have not opted out of IBA", "Identifier_Device_ID_3rdParty"], ["Advertisers may choose their audience by location, demographics, likes, keywords, age & gender, interests, behaviors, connections and any other information FB receives or infers about users.", "Demographic_3rdParty"], ["By doing so the other provider may receive or gather information about you and use the information for displaying targeted ads.", "Demographic_3rdParty"], ["For example we pass advertising IDs to FB and they match it with your FB ID, aggregate it and delete the initial identifier.", "Demographic_3rdParty"], ["We cooperate with several providers of IBA, Facebook, MoPub, InMobi, Google (Adx), Google (AdMob), AppLovin and My.Com (''Third Parties'').", "Demographic_3rdParty"], ["For a detailed explanation about what information is being used for what purposes and by which Partners please see the \"Cookie\" section of this Privacy Policy.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may share information that can be used to personally identify your device (e.g.", "Identifier_3rdParty"], ["persistent identifiers such as IDFA, IDFV, advertising ID and IP address) for the purposes of delivering our services, displaying advertisements, conducting analysis and research and for measuring our advertising campaign performance:", "Identifier_3rdParty"], ["For any additional questions about third party information collection please refer to privacy@outfit7.com.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["For detailed information about information collection and the usage practices of our partners please see the \"Cookie\" section of this Privacy Policy.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["In addition, Partners may use their own tracking technologies (including and without limitation: cookies, Web beacons, HTTP cache, and local shared objects) to compile anonymous information about users of the Applications and visitors to the Websites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Information collected by third parties, which may include such things as location information or contact details, is governed by their privacy practices.", "Contact_3rdParty"], ["These other websites or services may place their own cookies or other files on your computing device, collect information or solicit personal information from you.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["If you choose the opt-out option available via our apps, we will not share your device ID with advertisers for the purposes of IBA; or, if already shared, we will remove it from their services.", "Identifier_Device_ID_3rdParty"], ["Advertising Identifier is an anonymous identifier for advertising purposes which enables users to reset their identifier or opt out of interest-based ads.", "Identifier_Ad_ID_3rdParty"], ["The parties participating in advertising are obligated to follow users' choice for opting out of tracking according to the app store guidelines.", "Identifier_Ad_ID_3rdParty"], ["The reason for switching from device IDs to Advertising Identifier is that advertisers are able to use this identifier only for advertising and for no other purpose, while users can choose to opt out of tracking via the settings of mobile phone.", "Identifier_Ad_ID_3rdParty"]]