[["Advertisers and third-party advertising partners may use third-party cookies in order to collect information about you, which may include how many times you have seen their ads or whether you have interacted with an ad.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Advertisers' and other third parties' use of cookies: Advertisers and third-party advertising partners that deliver ads to you on the Service may place or recognize a unique cookie on your hard drive.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["If you would like to review and modify your interest-based advertising settings, visit Your Advertising Choices on Pandora.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Most major web browsers provide users with the option to accept or reject third-party cookies.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The use of third-party cookies is not covered by this privacy policy.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These types of non-Pandora cookies are known as \"third-party cookies.\"", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["They may also use third-party cookies to provide you with interest-based advertising.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We do not have access to or control over cookies placed by advertisers and other third parties.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["For example, we use third-party providers such as Nielsen and ScorecardResearch to measure how long and how frequently you are using the Service.", "Identifier_Device_ID_3rdParty"], ["Our advertising partners may use these providers to measure the effectiveness of their advertising campaigns.", "Identifier_Device_ID_3rdParty"], ["When we use these providers, we provide them with non-personally identifiable information about you, such as your device identifier.", "Identifier_Device_ID_3rdParty"], ["Sharing of Anonymized, Non-Personally Identifiable or Aggregated Data: Pandora may share with third parties, advertisers, and/or business partners anonymized, non-personally identifiable, or aggregated data we receive or collect, such as de-identified demographic information, de-identified location information, information about the computer or device from which you access the Service, or information about the stations, tracks, and artists you listen to, thumb-up, thumb-down, or bookmark.", "Demographic_3rdParty"], ["The use and disclosure of such anonymized, non-personally identifiable, or aggregated information is not subject to any restrictions under this policy.", "Demographic_3rdParty"], ["We share such information for a variety of reasons, such as to analyze Service usage, improve the Pandora Service and your listener experience, improve the serving of advertisements, or for other similar purposes.", "Demographic_3rdParty"]]