[["In addition, if permitted by your mobile device settings, the App may provide, to Third Party Advertisers,", "Identifier_Device_ID_3rdParty"], ["your device ID (as further described in Section 3 and", "Identifier_Device_ID_3rdParty"], ["your precise location data (as further described in Section 5 ).", "Identifier_Device_ID_3rdParty"], ["Certain Sega Apps are currently supported by third party ad servers or ad networks that serve advertisements (\"Third Party Advertisers\"), including behavioral or interest based advertising (\"Interest Based Advertising\"), within the Sega Apps.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These Third Party Advertisers use technology to send, directly to your mobile device, the advertisements and links that appear in the Sega Apps.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["They may automatically receive your device ID, IP address or geo-location data when this happens.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["In addition, certain Third Party Advertisers may collect limited personally identifiable information, such as device ID, IP address or geo-location data, as further described in Sections 3 and 5.", "Identifier_Device_ID_3rdParty"], ["Certain Third Party Advertisers in Sega Apps may collect precise location data, or street-level location information, about you.", "Location_3rdParty"], ["Sega Apps are not currently supported by third party ad servers or ad networks that serve advertisements (\"Third Party Advertisers\"). No Third Party Advertisers receive your device ID, IP address or geo-location data.", "Identifier_Device_ID_3rdParty"], ["In addition, Third Party Advertisers do not collect personally identifiable information, such as device ID, IP address or geo-location data, as further described in Sections 3 and 5.", "Identifier_Device_ID_3rdParty"], ["The App does not provide, to Third Party Advertisers, your device ID (as further described in Section 3) and your precise location data (as further described in Section 5 ).", "Identifier_Device_ID_3rdParty"], ["Third Party Advertisers in Sega Apps are not collecting precise location data, or street-level location information, about you.", "Location_3rdParty"]]