[["Since the third party advertising companies associate your computer/device with a number, they will be able to recognize your computer/device each time they send you an advertisement.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may feature advertisements served by third parties that deliver cookies to your computer/device so the Content you access and advertisements you see can be tracked.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Our services may contain third party tracking tools from our service providers, examples of which include tracking tools from Apsalar, Google Analytics, and Swrve.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Such third parties may use cookies and other software tools in our services to enable them to collect and analyze user information on our behalf.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These third parties may have access to information such as your device identifier, MAC address, IMEI, locale (specific location where a given language is spoken), geo-location information, and IP address.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The advertisers may collect and use information about you, such as your Service session activity, device identifier, MAC address, IMEI, geo-location information and IP address.", "Identifier_Device_ID_3rdParty"], ["We may feature advertising within our Service.", "Identifier_Device_ID_3rdParty"], ["After clicking on one of these advertisements and installing our Game, you will become a user of our Service.", "Identifier_Device_ID_3rdParty"], ["In addition, you may see our Games advertised in other services.", "Identifier_Device_ID_3rdParty"], ["In order to verify the installs, a device identifier may be shared with the advertiser.", "Identifier_Device_ID_3rdParty"], ["For example, we may provide third party advertisers with the aggregate number of males of a certain age in a specific country who are playing one of our Games.", "Demographic_3rdParty"], ["We do not sell or rent your personally identifiable information to any third party, although non-personally identifiable information may be used to assist advertisers in targeting their services to specific user demographics.", "Demographic_3rdParty"], ["We do not share your personal information except as approved by you or as described below.", "Demographic_3rdParty"], ["We share statistics of each user's activities and data within reports that are used internally and externally by our publishing and distribution partners to analyze the Game, its features and performance.", "Demographic_3rdParty"], ["With your consent, for example, when you agree to our sharing your information with other third parties for their own marketing purposes subject to their separate privacy policies", "Demographic_3rdParty"], ["Our services may contain third party tracking tools from our service providers, examples of which include tracking tools from Apsalar, Google Analytics, and Swrve. None of such third parties uses cookies and other software tools in our services and do not have access to information such as your device identifier, MAC address, IMEI, locale (specific location where a given language is spoken), geo-location information, and IP address.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may feature advertising within our Service. The advertisers do not collect and use information about you, such as your Service session activity, device identifier, MAC address, IMEI, geo-location information and IP address.", "Identifier_Device_ID_3rdParty"]]