[["Based on your permissions, some additional information can be shared with Third Party Applications and with others through Third Party Applications.", "Contact_E_Mail_Address_3rdParty"], ["For example, you can use your settings to control whether your Spotify activity is posted to Facebook.", "Contact_E_Mail_Address_3rdParty"], ["Please remember that certain information is always publicly available, which means that it can be accessed by Third Party Applications through our APIs and developer tools.", "Contact_E_Mail_Address_3rdParty"], ["Similarly, you may consent to provide Third Party Applications with access to your email address, subscription status, location, birthday, or similar information, upon their request.", "Contact_E_Mail_Address_3rdParty"], ["If you log into a Third Party Application with your Spotify account, that Third Party Application may have access to certain information such as your playlists, content saved, and activity.", "Contact_E_Mail_Address_3rdParty"], ["With your explicit permission, we may also share additional information such as your email address, subscription status, location, or birthdate with such Third Party Applications.", "Contact_E_Mail_Address_3rdParty"], ["Third Party We may allow our business partners to use cookies on or outside the Spotify Service for the same purposes identified above, including collecting information about your online activities over time and across different websites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may also use service providers acting on our behalf to use cookies for the purposes identified above.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Cookies may be used to serve you with advertisements that may be relevant to you and your interests on other web sites and services and to regulate the advertisements you receive and measure their effectiveness.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Spotify Ads We work with web publishers, advertising networks, and service providers to deliver Spotify ads on other web sites and services.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]