[["We may share the location information we collect with third parties as addressed in Section 4, below.", "Location_3rdParty"], ["Use of Cookies, Web Beacons, and Other Technologies by Advertisers, Ad Networks, and Ad Servers", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We work with a variety of advertisers, advertising networks, advertising servers, and analytics companies (\"Ad Partners\") that use various technologies to collect data about your use of the Services (such as pages visited, ads viewed or clicked on) in order to send (or serve) relevant ads.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Ad Partners may place cookies, web beacons and/or other data collection technologies on the Services to (among other purposes)", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Ad Partners may place cookies, web beacons and/or other data collection technologies on the Services to (among other purposes): track how the Services are used, where users go and what they do after they leave the Services; link users' devices; and serve more relevant ads on the Services or other websites that you visit.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Information about these third parties is available here", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Use of Cookies by Third Parties for Analytics We contract with certain third parties that use data collection technologies to track, analyze and report data about the use of the Services and to analyze and optimize the performance of the Services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Companies Offering Promotions, Products, or Services.", "Demographic_3rdParty"], ["We may share demographic information, location data, advertising identifiers, IP address and aggregate (not individual) usage statistics for the Services with advertisers and other third parties.", "Demographic_3rdParty"], ["For example, if it's raining at your location, we may present you with tools that allow you to request a ride or have food delivered; if you're looking at the weather forecast for a vacation destination, we may present you with tools that allow you to book flights or lodging.", "Location_3rdParty"], ["If you want to take advantage of the service, you can choose to share additional information to do so.", "Location_3rdParty"], ["Some of the Services may integrate and share certain information that does not reasonably identify you or your device with third-party services that you may want to use in order to determine if the services or offers make sense for you and are available in your general area.", "Location_3rdParty"], ["We do not control these third-parties' data practices, and their collection, use, and sharing of the information is governed by their respective privacy policies.", "Location_3rdParty"], ["Ad Partners may also collect, or we may also provide to Ad Partners, information via the technologies discussed in section 3 above or via interactive ads.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may share information we collect (see above) with Ad Partners so that they can deliver relevant content or ads on their own websites or apps or other third party websites or apps and analyze and report on content or ads users see or interact with.", "Location_3rdParty"], ["Ad Partners do not place cookies, web beacons and/or other data collection technologies on the Services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We are not sharing the location information we collect with promotional companies as addressed in Section 4, below.", "Location_3rdParty"]]