[["Ad companies also use device IDs or Advertising IDs to track your use of the app, track the number of ads displayed, measure ad performance and display ads that are more relevant to you.", "Identifier_Ad_ID_3rdParty"], ["Analytics companies use device IDs to track information about app usage.", "Identifier_Device_ID_3rdParty"], ["Information collected by third-parties for advertising purposes.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Opting out will not decrease the number of advertisements you see.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Some of these third-party advertising companies may be advertising networks that are members of the Network Advertising Initiative, which offers a single location to opt out of ad targeting from member companies ( www.networkadvertising.org ).", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These companies may use tracking technologies, such as cookies or web beacons, to collect information about users who view or interact with their advertisements.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["To opt-out of cookies that may be set by third party data or advertising partners, please go to http://www.aboutads.info/", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We do not provide any non-masked or non-obscured personal information to third parties.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may allow service providers, advertising companies and ad networks, and other third parties to display advertisements on our Service and elsewhere.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["For example, we may engage a data provider who may collect web log data from you (including IP address and information about your browser or operating system), or place or recognize a unique cookie on your browser to enable you to receive customized ads or content.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We also may share aggregated, non-personal information, or personal information in hashed, non-human readable form, with third parties, including advisors, advertisers and investors, for the purpose of conducting general business analysis, advertising, marketing, or other business purposes.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Ad companies do not use device IDs or Advertising IDs.", "Identifier_Ad_ID_3rdParty"], ["Analytics companies do not use device IDs.", "Identifier_Device_ID_3rdParty"], ["We do not share with ad networks aggregated, non-personal information, or personal information (including IP address and information about your browser or operating system), and do not place or recognize a unique cookie on your browser.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]