[["As used herein, the term \"personal information\" means information that specifically identifies any individual ( including without limitation, name, date of birth, address, telephone/mobile number, e-mail address, or payment/billing information), and any other information that is required by applicable law to be treated as Personal Information (\"Personal Information\").", "Contact_E_Mail_Address_3rdParty"], ["Ubisoft makes its best efforts to (a) provide you with the list of partners whose cookies and other analytic tools are used in our Services, (b) links to these partners' own privacy policies according to which their tools and technologies are used, and (c) when available, to provide you with a link to allow you to opt-out from these partners' services.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The analytics tools and ad serving technologies may use server log files, web beacons, cookies (as further described below), tracking pixels and other technologies to collect said information,", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The information collected and used for the interest based advertising may contain the following, without limitation: age and gender, number views of an advertisement, device unique identity or other device identifiers and settings, information about your use of the products and Services and other Internet sites (including third party web pages and mobile Internet sites) viewed by you (as well as date and time viewed), advertisement(s) served, the advertisement(s)' in game location and length, and your response to the advertisement(s) (if any).", "Demographic_Age_3rdParty"], ["We may use third party ad serving technologies that collect information as a result of ad serving in the products and Services, and then temporarily display advertisements on the Services and third party sites.", "Demographic_Age_3rdParty"], ["By playing an Ubisoft game through a social network or other third party platform or service, or by connecting to a third party account, network, platform or service via one of our products and/or Services, you are authorizing Ubisoft to", "Contact_E_Mail_Address_3rdParty"], ["share any and all of your Personal Information with the console manufacturer, social network or other third party platform, through the third party platform's Application Programming Interface (API).", "Contact_E_Mail_Address_3rdParty"], ["As used herein, the term \"personal information\" means information that specifically identifies any individual ( including without limitation, name, date of birth, address, telephone/mobile number, e-mail address, or payment/billing information), and any other information that is required by applicable law to be treated as Personal Information (\"Personal Information\"), which Ubisoft does not share any of your Personal Information with third party ad companies.", "Contact_E_Mail_Address_3rdParty"], ["We do not use third party ad serving technologies. Advertisers do not collect age, gender, device unique identity or other device identifiers and settings.", "Demographic_Age_3rdParty"], ["The analytics tools and ad serving technologies do not use web beacons, cookies (as further described below), tracking pixels and other technologies to collect said information.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]