[["Certain Verizon vendors may place and read cookies on our sites to help us deliver Verizon marketing messages on our sites and on non-Verizon sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["In accordance with industry self-regulatory principles, you should see this icon in", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We require that these vendors provide consumers with the ability to opt out of their use of information for these purposes.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Additional information on the choices available to you for the use of your information for advertising purposes can be found in the \"How to limit the sharing and use of your information\" section below.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Clicking on this icon will provide information about the companies and data practices that were used to deliver the ad and will also describe how you may opt out of this type of advertising program.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["or around Verizon advertisements that are delivered on other sites using information collected on our sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Many types of wireless apps and services use mobile device location data, including apps provided by other companies and wireless device operating systems.", "Location_3rdParty"], ["We may also share location information with others in a way that does not personally identify you so that they may produce aggregate business and marketing reports.", "Location_3rdParty"], ["Some advertisements are chosen by companies that operate on our sites and other sites (for example, ad servers, ad networks, or technology platforms) to place ads on behalf of advertisers.", "Identifier_Ad_ID_3rdParty"], ["Targeting may be accomplished by tailoring advertising to interests that they infer from your interactions on our sites and apps and your interaction with other sites and services where these companies also are present.", "Identifier_Ad_ID_3rdParty"], ["The information they collect from our sites and apps is in a form that does not identify you personally and may be combined with similar data they obtain from other websites and apps to help advertisers better reach audiences they wish to target.", "Identifier_Ad_ID_3rdParty"], ["These companies may place and access cookies on your device to collect information about your visit on websites and may collect device advertising identifiers from your mobile operating system to learn about your use of apps, including ours.", "Identifier_Ad_ID_3rdParty"], ["You may see third-party advertisements on some Verizon websites, services, apps and devices.", "Identifier_Ad_ID_3rdParty"], ["We also may permit advertisers on our sites, apps and services to place ads based on certain information we have about your Verizon products and services as well as geographic and demographic data.", "Demographic_3rdParty"], ["Verizon websites and services may include social network or other third-party plug-ins and widgets that may provide information to their associated social networks or third-parties about your interactions with Verizon pages you visit or services you use, even if you do not click on or otherwise interact with the plug-in or widget.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We may also not share location information with advertising partners and others.", "Location_3rdParty"], ["The wireless apps and services do not use third party mobile device location data.", "Location_3rdParty"], ["Verizon vendors may not place and read cookies on our.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We also are not permitting advertisers on our sites, apps and services to place ads based on certain information we have about your Verizon products and services, particularly, geographic and demographic data.", "Demographic_3rdParty"], ["Third-party advertisement companies may not place and access cookies on your device to collect information about your visit on websites. They are not allowed to collect device advertising identifiers from your mobile operating system.", "Identifier_Ad_ID_3rdParty"], ["Third parties do not place cookies on our sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Verizon websites and services do not include social network or other third-party plug-ins or widgets.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]