[["Our websites include social media features, such as the Facebook \"Like\" button and widgets, which include the \"Share This\" button or interactive mini-programs that run on our sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Social media features and widgets are either hosted by a third party or hosted directly on our sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["These features may collect your IP Address, track which page you are visiting on our site, and may set a cookie to enable the features to function properly.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Your interactions with these features are governed by the privacy policy of the company providing it.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Often, these third party advertising companies employ cookie, pixel tag and other technologies to measure the effectiveness of Web, app and email advertisement and to create a record of interaction with our content that they use in conjunction with their advertising which appears on other sites or apps, or for reporting website traffic, app use, statistics, advertisement data and/or other activities on our sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["Ziff Davis and some of our advertisers use third party advertising service companies to serve advertisements when you visit our sites or use our apps.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["The aggregate statistics that describe our online audience—which are often based on the information you provide when you subscribe, register, or browse our sites—help us sell advertising by, among other things, describing the demographics of our visitors, and otherwise publicize Ziff Davis and our brands.", "Demographic_3rdParty"], ["What We Provide to Third Parties:", "Demographic_3rdParty"], ["These companies work on our behalf, and we do not provide our lists or other data to them for their own permanent use.", "Contact_E_Mail_Address_3rdParty"], ["They should also maintain the confidentiality of the information and are prohibited from using it for any other purpose.", "Contact_E_Mail_Address_3rdParty"], ["Those service providers will be permitted to obtain only the information they need to deliver the service.", "Contact_E_Mail_Address_3rdParty"], ["We provide customer lists, email addresses and other information identified above to third party companies and contractors who provide us with specialized services, such as email message deployment, email address validation, merge-purge (identifying and removing duplicate addresses), subscription fulfillment, customer support and service, research, statistical analysis, data and website hosting, and other data and transaction processing.", "Contact_E_Mail_Address_3rdParty"], ["These efforts do not result in the collection of personally identifiable information such as name or address", "Contact_Postal_Address_3rdParty"], ["Our ad network partners may use cookies and Web beacons to collect non-personally identifiable information about your activities on our owned and operated sites and third party websites to provide you targeted advertising based upon your interests.", "Identifier_Cookie_or_similar_Tech_3rdParty"], ["We partner with third party ad networks to either display advertising on our website or to manage our advertising on other sites.", "Identifier_Cookie_or_similar_Tech_3rdParty"]]